'''Вычислить и вывести на экран сумму кубов натуральных чисел от 1 до n включительно. 
Верхний предел должен вводиться с клавиатуры и не должен превышать числа 100'''
s = 0
a = int(input('Введите число n от 1 до 100:'))
if 1 <= a <= 100:
    for i in range(1, a + 1):
        s += i ** 3
print('Сумма кубов от 1 до', a, 'равна', s)

'''Выведите на экран таблицу умножения чисел от одного до девяти'''
print('Таблица умножения чисел от 1 до 9.')
a = 0
for i in range(1, 10):
 for i2 in range(1, 10):
    a = i * i2
    print(i, '*', i2, '=', a)