'''
Добавить к задаче проверку на целостность цисла: сравнивает только если числа целые, иначе выдает ошибку через `print("Ошибка, вводи целые!")`.
'''
a = float(input("Введите первое целое число \n"))
b = float(input("Введите первое целое число \n"))
c = float(input("Введите первое целое число \n"))
if a == int(a) and b == int(b) and c == int(c):
    if a<b:
        if a<c:
            y=a
        else:
            y=c
    else:
        if b<c:
            y=b
        else:
            y=c
    print("Минимальное число ", int(y))
else: print('Error: введите целые числа!')


'''
Даны три целых числа. 
Выбрать из них те, которые принадлежат интервалу [1,3].
'''
flag = 0
s = []
while flag < 3:
    a = float(input())
    if 1 <= a <= 3: s.append(a)
    flag += 1
print(s)