'''Дано вещественное число – цена 1 кг конфет. Вывести стоимость 1, 2, ... 10 кг конфет.  
Решить задачу используя циклическую конструкцию for.'''
stoimost = float(input('Введите стоимость конфет: '))
for i in range(1, 11):
    print('Стоимость', i, 'кг конфет -', round(i * stoimost, 2), 'рублей')


'''
2. Дана непустая последовательность целых чисел, оканчивающаяся нулем. 
Найти: 
а) сумму всех чисел последовательности; 
б) количество всех чисел последовательности.  
Решить задачу используя циклическую конструкцию while.
'''
a = 1
f = []
while a!= 0:
    a = float(input())
    f.append(a)
kolvo = len(f)
summa = sum(f)
print('Сумма всех чисел последовательности:', summa)
print('Количество всех чисел последовательности:', kolvo)


'''3. Найдите сумму всех элементов списка [1, '2', 3, 4, '5'], предварительно приводя строки к целым числам.'''
s = [1, '2', 3, 4, '5']
f = 0
for i in range(len(s)):
    i  = int(s[i])
    f += i
print('Сумма всех членов списка:',f)


'''
4.
'''
flag = 0
print('-' * 30)
for i in 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя':
    if flag == 5:
        print('\n' + '-' * 30)
        flag = 0
    print('| ' + i.upper() + i + ' |', end = '')
    flag += 1
print('\n' + '-' * 18)