'''Написать программу, которая будет делить введенные пользователем два вещественных числа и выводить результат на экран, сообщая об ошибке в случае деления на ноль'''
a = float(input('Введите первое число: '))
b = float(input('Введите второе число: '))
if b == 0:
    print('Ошибка. На ноль делить нельзя')
else:
    print('Результат: ', a / b)

'''Рассчитать стоимость покупки с учетом скидки в 35%, которая предоставляется покупателю, если сумма покупки превышает 20 у.е. 
Сумму покупки ввести с клавиатуры, а результаты округлить до сотых (копейки, центы и т.д.)
Вывести на экран итоговую стоимость и размер предоставленной скидки'''
summa = int(input('Введите стоимость покупки: '))
a = 0
skidka = 0
if summa > 20:
    skidka = summa / 100 * 35
    a = summa - skidka
else:
    a = summa
print('Итоговая стоимоть покупки:', round(a, 2))
print('Размер предоставленной скидки:', round(skidka, 2))

'''Напишите скрипт, который по введенному пользователем числу от 1 до 12, будет выводить на экран сообщение в виде названия месяца и времени года. 
Если пользователь введет недопустимое число, программа должна выдавать сообщение об ошибке'''
a = int(input('Введите число от 1 до 12: '))
if 0 < a < 13:
    if a in range(1, 3) or a == 12:
        print('Зима')
        if a == 1: print('Январь')
        elif a == 2: print('Ферваль')
        else: print('Декабрь')
    elif a in range(3, 6):
        print('Весна')
        if a == 1: print('Март')
        elif a == 2: print('Апрель')
        else: print('Май')
    elif a in range(6, 9):
        print('Лето')
        if a == 1: print('Июнь')
        elif a == 2: print('Июль')
        else: print('Август')
    elif a in range(9, 12):
        print('Осень')
        if a == 1: print('Сентябрь')
        elif a == 2: print('Октябрь')
        else: print('Ноябрь')
else:
    print('Такого месяца не существует')