'''
1.Написать программу, которая будет делить введенные пользователем два вещественных числа и выводить результат на экран, 
сообщая об ошибке в случае деления на ноль.
'''
a = float(input('Введите числитель: '))
flag = 0
while flag < 1:
    b = float(input('Введите знаминатель: '))
    if b == 0:
        print('Error: На ноль делить нельзя!')
    else:
        flag += 1
print('Результат: ', a / b)


'''
Рассчитать стоимость покупки с учетом скидки в 35%, которая предоставляется покупателю, если сумма покупки превышает 20 у.е. 
Сумму покупки ввести с клавиатуры, а результаты округлить до сотых (копейки, центы и т.д.). 
Вывести на экран итоговую стоимость и размер предоставленной скидки.
'''
from math import *

stoimost = float(input('Введите стоимость покупки: '))
itog_stoimost = 0
skidka = 0
if stoimost > 20:
    skidka = stoimost * 35 / 100
    itog_stoimost = stoimost - skidka
else:
    itog_stoimost = stoimost 
print('Итоговая стоимоть покупки: ' + str(round(itog_stoimost, 2)), 'Размер предоставленной скидки: ' + str(round(skidka, 2)), sep = '\n')


'''
Напишите скрипт, который по введенному пользователем числу от 1 до 12, будет выводить на экран сообщение в виде названия месяца и времени года. 
Если пользователь введет недопустимое число, программа должна выдавать сообщение об ошибке.
'''
a = float(input('Введите число от 1 до 12: '))
a = int(a) #a = int(input()) выдаёт ошибку компиляции при вводе дробных чисел
flag = 0
while flag < 1:
    if 0 < a < 13:
        flag += 1
    else:
        print('Error: Введите корректное число!')
        a = float(input()) 
        a = int(a) #a = int(input()) выдаёт ошибку компиляции при вводе дробных чисел
s = ['', 'Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь']
s2 = [''] + ['Зима'] * 2 + ['Весна'] * 3 + ['Лето'] * 3 +['Осень'] * 3 + ['Зима']
print('Месяц: ' + s[a], 'Время года: ' + s2[a], sep = '\n')