#На СДО не даёт прикрепить более 1 файла. Задания отделил двумя пустыми строками. Васильев Тимур, 4931101/30002.


'''
1.Вычислить и вывести на экран длину окружности и площадь круга одного и того же заданного радиуса R, который необходимо ввести с клавиатуры в сантиметрах. 
Результаты должны округляться до сотых.
'''
from math import *
print('Введите радиус окружности в сантиметрах.')
r = float(input()) 
s = pi * (pow(r, 2))
l = 2 * pi * r
print('Длина окружности Вашего круга равна ' + str(round(l, 2)) + ' сантиметров.', 'Площадь Вашего круга равна ' + str(round(s, 2)) + ' сантиметров.', sep = '\n')


'''
2.Даны две переменные x = 10 и y = 55. 
Поменяйте их значения местами. 
Выведите значения переменных на экран до и после замены.
'''
x = 10
y = 55
print('Было:', 'x = ' + str(x), 'y = ' + str(y), sep = '\n')
f = x
x = y
y = f
print('Стало:', 'x = ' + str(x), 'y = ' + str(y), sep = '\n')


'''
3.Вычислить и вывести на экран период колебания маятника длиной L с точностью до сотых. 
Для рассчетов использовать формулу T = 2π√(L/g), где g – ускорение свободного падения (9.81 м/c2). 
Значение длины маятника в метрах необходимо ввести с клавиатуры.
'''
from math import *
print('Введите длину маятника в метрах.')
l = float(input())
g = 9.81
t = 2 * pi * sqrt(l / g)
print('Период колебания Вашего маятника равен: ', round(t, 2), 'секунд.')