'''
1. Вычислить и вывести на экран сумму кубов натуральных чисел от 1 до n включительно. 
Верхний предел должен вводиться с клавиатуры и не должен превышать числа 100.
'''
print('Введите число n от 1 до 100.')
flag = 0
n_summ = 0
while flag < 1:
    n = int(input())
    if 0 <= n <= 100:
        flag += 1
    else:
        print('Введите корректное число')
for i in range(1, n + 1):
    n_summ += i ** 3
print('Сумма кубов от 1 до', n, 'равна', n_summ)


'''
2.Выведите на экран таблицу умножения чисел от одного до девяти.
'''
# Даже с подсказкой с доски не понял как сделать красивый print
print('Таблица умножения чисел от одного до 9.')
otstup = ''
for i in range(1, 10):
 for n in range(1, 10):
    if n == 9:
       otstup = '\n'
    else:
       otstup = ''
    print(i, '*', n, '=', i * n, otstup)