'''
1.Дана строка. Подсчитать самую длинную последовательность подряд идущих букв «н». 
Преобразовать ее, заменив точками все восклицательные знаки.
'''
s = input('Введите строку.\n')
a = 0
max_length = 0
for i in s:
    if i.upper() == 'Н': 
        a += 1
    else: 
        if max_length <= a: 
            max_length = a
            a = 0
if a > max_length: max_length = a
print('Самая длинная последовательность идущих букв «н» составляет:', max_length)
print('Строка после изменений:', s.replace('!','.'))


'''
2.Дана строка символов, среди которых есть одна открывающаяся и одна закрывающаяся скобки. 
Вывести на экран все символы, расположенные внутри этих скобок.
'''
s = input('Введите строку.\n')
# ind1 = s.find('(') + 1
# ind2 = s.find(')')
# print(s[ind1:ind2])
print(s[s.find('(')+1:s.find(')')])


'''
3.Дана строка. 
Вывести все слова, начинающиеся на букву "а" и слова оканчивающиеся на букву "я".
'''
s = (input('Введите строку.\n')).split( )
for i in s:
    if i.upper().startswith('А'): print(i)
    if i.upper().endswith('Я'): print(i)